{
  "title": "Cosmic Poetry Journal",
  "subtitle": "A Platform for Scientific Expression Through Poetry",
  "description": "Cosmic Rhymes is the official journal of ISPA, covering various types, genres, and styles of poetry, with a particular focus on scientism poetry. The journal is dedicated to exploring the intersection of science and poetry, revealing the deep connections between scientific philosophy and human emotions, and showcasing the unique beauty where science and art converge. It is planned to be published in both English and Chinese.",
  "currentIssue": {
    "title": "Current Issue",
    "number": "Issue {{number}}",
    "theme": "Theme: {{theme}}",
    "description": "Explore our latest collection of scientism poetry, featuring works from renowned poets and scientists around the world."
  },
  "submissions": {
    "title": "Submit Your Work",
    "description": "We welcome submissions from poets who blend scientific insight with creative expression. See our submission guidelines for more information.",
    "button": "Submit Now"
  },
  "archive": {
    "title": "Archive",
    "description": "Browse our past issues and discover the evolution of scientism poetry through the years.",
    "button": "View Archive"
  },
  "featuredBook": {
    "title": "Featured Book",
    "bookTitle": "New Book Release",
    "description": "\"An Introduction to Scientism Poetry\" is a pioneering work that systematically constructs the theory of scientism poetry, defining its principles, creative manifesto, methodology, and classic examples. The author integrates scientific philosophy, theories, and methods into poetic creation, establishing science as a central approach to understanding the world and exploring truth. Through the fusion of reason and emotion, the work delves into the profound connections between nature, the universe, and the human spiritual realm, presenting its unique aesthetic and intellectual depth in diverse forms.",
    "button": "Get the Book"
  },
  "newBookAnnouncement": {
    "title": "New Book Announcement",
    "details": "\"Schrödinger’s Cat: A Scientism Poetry Collection\" ",
    "date": "Publication Date: March 2025"
  }
}
