{
  "intro": "Canadian Beaver Press is a comprehensive publishing house collaborating with the International Scientism Poetry Association (ISPA). It specializes in interdisciplinary publishing across literature, science, philosophy, and art, offering a diverse range of books with a particular focus on poetry.",
  "services": {
    "title": "Services",
    "items": {
      "1": "Poetry Publishing: Focus on publishing poetry works that integrate scientific elements, encouraging authors to reflect the fusion of science and art in their creations.",
      "2": "Editorial Services: Provide a professional editorial team to assist authors in perfecting their works, ensuring a balance between scientific accuracy and artistic expression.",
      "3": "Translation Services: Offer high-quality translation services for authors wishing to promote their works to international markets, expanding their readership.",
      "4": "Marketing: Utilize multi-channel marketing strategies to enhance the visibility and influence of works, including online and offline events, media promotion, etc.",
      "5": "Author Support: Regularly organize seminars, workshops, and other activities to promote exchange and collaboration among authors, collectively improving creative standards."
    }
  },
  "benefits": {
    "title": "Preferential Policies",
    "items": {
      "1": "New Author Support Program: Provide special offers for first-time authors, including publishing fee discounts and free editorial consultation services.",
      "2": "Member Exclusive Discounts: ISPA members enjoy special discounts when publishing works with Beaver Press. Contact the press for detailed information about specific benefits.",
      "3": "Long-term Collaboration Benefits: Authors establishing long-term partnerships with the press can enjoy ongoing publishing fee discounts and priority publishing rights."
    }
  },
  "contact": "For more information or to apply for membership, please visit our official website: www.scientismpoetry.com",
  "featuredBook": {
    "title": "Featured Book",
    "bookTitle": "New Book Release",
    "description": "\"An Introduction to Scientism Poetry\" is a pioneering work that systematically constructs the theory of scientism poetry, defining its principles, creative manifesto, methodology, and classic examples. The author integrates scientific philosophy, theories, and methods into poetic creation, establishing science as a central approach to understanding the world and exploring truth. Through the fusion of reason and emotion, the work delves into the profound connections between nature, the universe, and the human spiritual realm, presenting its unique aesthetic and intellectual depth in diverse forms.",
    "button": "Get the Book"
  },
  "newBookAnnouncement": {
    "title": "New Book Announcement",
    "details": "\"Schrödinger’s Cat: A Scientism Poetry Collection\" ",
    "date": "Publication Date: March 2025"
  }
}
